import random
import os
import time
print('''       ⣠⡴⠖⠒⠲⠶⢤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀         ⣠⡴⠖⠒⢶⣄⠀⠀⠀⠀⠀⠀⠀
    ⠀⠀⠀⢀⡾⠁⠀⣀⠔⠁⠀⠀⠈⠙⠷⣤⠦⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡼⠋⠀⠀⠀⢀⡿⠀⠀⠀⠀⠀⠀⠀
    ⣠⠞⠛⠛⠛⠋⠉⠀⠀⠀⠀⠀⠀⠀⠀⠘⢧⠈⢿⡀⢠⡶⠒⠳⠶⣄⠀⠀⠀⠀⠀⣴⠟⠁⠀⠀⠀⣰⠏⠀⢀⣤⣤⣄⡀⠀⠀
    ⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠟⠛⠛⠃⠸⡇⠈⣇⠸⡇⠀⠀⠀⠘⣇⠀⠀⣠⡾⠁⠀⠀⠀⢀⣾⣣⡴⠚⠉⠀⠀⠈⠹⡆⠀
    ⣹⡷⠤⠤⠤⠄⠀⠀⠀⠀⢠⣤⡤⠶⠖⠛⠀⣿⠀⣿⠀⢻⡄⠀⠀⠀⢻⣠⡾⠋⠀⠀⠀⠀⣠⡾⠋⠁⠀⠀⠀⠀⢀⣠⡾⠃⠀
    ⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡤⠖⠋⢀⣿⣠⠏⠀⠀⣿⠀⠀⠀⠘⠉⠀⠀⠀⠀⠀⡰⠋⠀⠀⠀⠀⠀⣠⠶⠋⠁⠀⠀⠀
    ⢿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡾⠋⠁⠀⠀⠠⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠁⠀⠀⠀⢀⣴⡿⠥⠶⠖⠛⠛⢶⡄
⠀   ⠉⢿⡋⠉⠉⠁⠀⠀⠀⠀⠀⢀⣠⠾⠋⠀⠀⠀⠀⢀⣰⡇⠀⠀⢀⡄⠀⠀⠀⠀⠀⠀⠀⠀⢀⡴⠋⠀⠀⠀⠀⠀⢀⣠⠼⠃
⠀   ⠀⠈⠛⠶⠦⠤⠤⠤⠶⠶⠛⠋⠁⠀⠀⠀⠀⠀⠀⣿⠉⣇⠀⡴⠟⠁⣠⡾⠃⠀⠀⠀⠀⠀⠈⠀⠀⠀⣀⣤⠶⠛⠉⠀⠀⠀
    ⠀⠀⠀⠀⢀⣠⣤⣀⣠⣤⠶⠶⠒⠶⠶⣤⣀⠀⠀⠀⢻⡄⠹⣦⠀⠶⠛⢁⣠⡴⠀⠀⠀⠀⠀⠀⣠⡶⠛⠉⠀⠀⠀⠀⠀⠀⠀
    ⠀⠀⢀⡴⠋⣠⠞⠋⠁⠀⠀⠀⠀⠙⣄⠀⠙⢷⡀⠀⠀⠻⣄⠈⢷⣄⠈⠉⠁⠀⠀⠀⢀⣠⡴⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⢀⡾⠁⣴⠋⠰⣤⣄⡀⠀⠀⠀⠀⠈⠳⢤⣼⣇⣀⣀⠀⠉⠳⢤⣭⡿⠒⠶⠶⠒⠚⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⢸⠃⢰⠇⠰⢦⣄⡈⠉⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠉⠛⠛⠓⠲⢦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⠸⣧⣿⠀⠻⣤⡈⠛⠳⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⢻⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⠀⠈⠹⣆⠀⠈⠛⠂⠀⠀⠀⠀⠀⠀⠈⠐⠒⠒⠶⣶⣶⠶⠤⠤⣤⣠⡼⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⠹⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠳⢦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠈⠻⣦⣀⠀⠀⠀⠀⠐⠲⠤⣤⣀⡀⠀⠀⠀⠀⠀⠉⢳⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
    ⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠶⠤⠤⠤⠶⠞⠋⠉⠙⠳⢦⣄⡀⠀⠀⠀⡷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
      ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠳⠦⠾⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀''')
print("Камень ножницы бумага ")
arrayKNB_bot = ["Камень", "Ножницы","Бумага"]
count = 0
bot_count =  0

while True:
    randomVar = random.randint(0,2)
    print(" Сделайте выбор: Камень/Ножницы/Бумага\n")
    print(" Узнать счёт: Счёт/Узнать Счёт \n")
    print(" Сбросить счёт: Заново/Сбросить счёт\n")
    choice = input()
    match choice:
        case "Камень" | "камень" | "КАМЕНЬ" | "rock"| "ROCK"| "Rock" | "к" | "К"|"r"|"R":
            if randomVar == 1:
                print("Победа! Бот выбрал Ножницы")
                count+=1
                time.sleep(3)
                os.system('cls||clear')
            elif randomVar == 0:
                print("Бот выбрал Камень! Ничья!")
                time.sleep(3)
                os.system('cls||clear')
            else:
                print("Бот выбрал Бумагу! Поражение!")
                bot_count+=1
                time.sleep(3)
                os.system('cls||clear')
        case "Бумага" | "бумага" | "БУМАГА" | "paper" | "PAPER" | "Paper" | "б" | "Б" | "p"|"P":
            if randomVar == 0:
                print("Победа! Бот выбрал Камень")
                count+=1
                time.sleep(3)
                os.system('cls||clear')
            elif randomVar == 2:
                print("Бот выбрал Бумагу! Ничья!")
                time.sleep(3)
                os.system('cls||clear')
            else:
                print("Бот выбрал Ножницы! Поражение!")
                bot_count+=1
                time.sleep(3)
                os.system('cls||clear')
        case "Ножницы" | "ножницы" | "НОЖНИЦЫ" | "scissors" | "SCISSORS" | "Scissors" | "н" | "Н" | "s"|"S":
            if randomVar == 2:
                print("Победа! Бот выбрал Бумагу")
                count+=1
                time.sleep(3)
                os.system('cls||clear')
            elif randomVar == 1:
                print("Бот выбрал Ножницы! Ничья!")
                time.sleep(3)
                os.system('cls||clear')
            else:
                print("Бот выбрал Камень! Поражение!")
                count-=1
                time.sleep(3)
                os.system('cls||clear')
        case "Счёт"|"счёт"|"Счет"|"счет"|"count"|"Count"|"c"|"C"|"с"|"С"|"Узнать счёт"|"узнать счёт"|"Узнать счет"|"узнать счет":
            text = f"Ваш счёт {count}, счёт бота {bot_count}"
            print(text)
        case "сбросить счёт"|"сбросить"|"Сбросить"|"Сбросить счёт"|"Сбросить счет"|"Заново"|"заново":
            count = 0
            bot_count = 0
        

